/**
 * 이 파일은 iconsAsset/convert.js에 의해 자동 생성되었습니다.
 * 직접 수정하는 대신 iconsAsset/convert.js를 수정하세요.
 */

import { memo, forwardRef } from 'react';

import { IconBase } from '../icon.base';
import { IconProps } from '../icon.type';

export const IcPinLine = memo(
  forwardRef<SVGSVGElement, IconProps>((props, ref) => (
    <IconBase ref={ref} viewBox="0 0 24 24" {...props}>
      <path
        d="M12.8068 12.5091C13.1419 12.2656 13.6109 12.3399 13.8544 12.675L19.7322 20.7652C19.9757 21.1003 19.9014 21.5693 19.5663 21.8128C19.2312 22.0563 18.7622 21.982 18.5187 21.6469L12.6408 13.5567C12.3974 13.2216 12.4717 12.7526 12.8068 12.5091Z"
        fillRule="evenodd"
        clipRule="evenodd"
        xmlns="http://www.w3.org/2000/svg"
      />
      <path
        d="M15.5741 9.13872L8.69746 14.1349C8.58576 14.2161 8.56099 14.3724 8.64215 14.4841C8.72331 14.5958 8.87965 14.6206 8.99135 14.5394L15.868 9.54323C15.9797 9.46208 16.0045 9.30573 15.9233 9.19403C15.8421 9.08233 15.6858 9.05757 15.5741 9.13872ZM7.81578 12.9214C7.03387 13.4895 6.86053 14.5839 7.42863 15.3658C7.99672 16.1477 9.09112 16.321 9.87303 15.7529L16.7497 10.7568C17.5316 10.1887 17.7049 9.09427 17.1368 8.31235C16.5687 7.53044 15.4743 7.3571 14.6924 7.9252L7.81578 12.9214Z"
        fillRule="evenodd"
        clipRule="evenodd"
        xmlns="http://www.w3.org/2000/svg"
      />
      <path
        d="M5.6952 6.3819L9.51581 11.6405L13.1564 8.99547L9.33578 3.73686L5.6952 6.3819ZM4.40902 5.46226C3.96221 5.78689 3.86316 6.41226 4.18778 6.85907L8.59617 12.9267C8.9208 13.3735 9.54617 13.4726 9.99298 13.1479L14.4426 9.91511C14.8894 9.59048 14.9884 8.96511 14.6638 8.5183L10.2554 2.45068C9.93079 2.00387 9.30542 1.90482 8.85861 2.22944L4.40902 5.46226Z"
        fillRule="evenodd"
        clipRule="evenodd"
        xmlns="http://www.w3.org/2000/svg"
      />
    </IconBase>
  ))
);

IcPinLine.displayName = 'IcPinLine';
