/**
 * 이 파일은 iconsAsset/convert.js에 의해 자동 생성되었습니다.
 * 직접 수정하는 대신 iconsAsset/convert.js를 수정하세요.
 */

import { memo, forwardRef } from 'react';

import { IconBase } from '../icon.base';
import { IconProps } from '../icon.type';

export const IcCancelFilled = memo(
  forwardRef<SVGSVGElement, IconProps>((props, ref) => (
    <IconBase ref={ref} viewBox="0 0 24 24" {...props}>
      <path
        d="M4.53251 5.32491L5.32447 4.53295C9.01102 0.846403 14.9881 0.846403 18.6746 4.53295L19.4666 5.32491C23.1532 9.01146 23.1532 14.9885 19.4666 18.6751L18.6746 19.467C14.9881 23.1536 9.01102 23.1536 5.32447 19.467L4.53251 18.6751C0.84596 14.9885 0.84596 9.01146 4.53251 5.32491ZM13.0602 12L15.3583 9.7019C15.6512 9.40901 15.6512 8.93414 15.3583 8.64124C15.0654 8.34835 14.5905 8.34835 14.2977 8.64124L11.9996 10.9393L9.70146 8.64124C9.40857 8.34835 8.93369 8.34835 8.6408 8.64124C8.34791 8.93414 8.34791 9.40901 8.6408 9.7019L10.9389 12L8.6408 14.2981C8.34791 14.591 8.34791 15.0659 8.6408 15.3588C8.93369 15.6517 9.40857 15.6517 9.70146 15.3588L11.9996 13.0607L14.2977 15.3588C14.5905 15.6517 15.0654 15.6517 15.3583 15.3588C15.6512 15.0659 15.6512 14.591 15.3583 14.2981L13.0602 12Z"
        fillRule="evenodd"
        clipRule="evenodd"
        xmlns="http://www.w3.org/2000/svg"
      />
    </IconBase>
  ))
);

IcCancelFilled.displayName = 'IcCancelFilled';
