/**
 * 이 파일은 iconsAsset/convert.js에 의해 자동 생성되었습니다.
 * 직접 수정하는 대신 iconsAsset/convert.js를 수정하세요.
 */

import { memo, forwardRef } from 'react';

import { IconBase } from '../icon.base';
import { IconProps } from '../icon.type';

export const IcFilterBarFilled = memo(
  forwardRef<SVGSVGElement, IconProps>((props, ref) => (
    <IconBase ref={ref} viewBox="0 0 24 24" {...props}>
      <path
        d="M10 7.39034H4C3.44772 7.39034 3 7.83806 3 8.39034C3 8.94262 3.44772 9.39034 4 9.39034H10C10.5523 9.39034 11 8.94262 11 8.39034C11 7.83806 10.5523 7.39034 10 7.39034Z"
        xmlns="http://www.w3.org/2000/svg"
      />
      <path
        d="M8 14.1603C7.15399 14.1578 6.37938 14.6342 6 15.3903H4C3.44772 15.3903 3 15.8381 3 16.3903C3 16.9426 3.44772 17.3903 4 17.3903H6C6.4954 18.3599 7.62079 18.8271 8.65718 18.4934C9.69356 18.1598 10.335 17.1238 10.1718 16.0473C10.0085 14.9709 9.08871 14.1717 8 14.1603Z"
        xmlns="http://www.w3.org/2000/svg"
      />
      <path
        d="M13.72 10.4603C14.4939 10.4592 15.2108 10.0533 15.61 9.39034H20C20.5523 9.39034 21 8.94262 21 8.39034C21 7.83806 20.5523 7.39034 20 7.39034H15.78C15.3575 6.35131 14.229 5.7878 13.1446 6.07435C12.0601 6.36089 11.3573 7.40832 11.5032 8.52044C11.6491 9.63255 12.5984 10.4632 13.72 10.4603Z"
        xmlns="http://www.w3.org/2000/svg"
      />
      <path
        d="M20 15.3903H12C11.4477 15.3903 11 15.8381 11 16.3903C11 16.9426 11.4477 17.3903 12 17.3903H20C20.5523 17.3903 21 16.9426 21 16.3903C21 15.8381 20.5523 15.3903 20 15.3903Z"
        xmlns="http://www.w3.org/2000/svg"
      />
    </IconBase>
  ))
);

IcFilterBarFilled.displayName = 'IcFilterBarFilled';
