/**
 * 이 파일은 icons/convert.js에 의해 자동 생성되었습니다.
 * 직접 수정하는 대신 icons/convert.js를 수정하세요.
 */

import { memo, forwardRef } from 'react';

import { IconBase } from '../icon.base';
import { IconProps } from '../icon.type';

export const IcPictureLine = memo(
  forwardRef<SVGSVGElement, IconProps>((props, ref) => (
    <IconBase ref={ref} viewBox="0 0 24 24" {...props}>
      <g clipPath="url(#clip0_1_146)" xmlns="http://www.w3.org/2000/svg">
        <path d="M19.5 4.5V19.5H4.49999V4.5H19.5ZM20.08 3H3.90999C3.78705 2.99988 3.66536 3.02468 3.55226 3.07289C3.43916 3.1211 3.33701 3.19173 3.25196 3.28052C3.16692 3.3693 3.10074 3.4744 3.05744 3.58946C3.01413 3.70453 2.99459 3.82717 2.99999 3.95V20.09C2.99999 20.3313 3.09587 20.5628 3.26653 20.7335C3.43719 20.9041 3.66865 21 3.90999 21H20.08C20.3223 21 20.5548 20.9045 20.727 20.7341C20.8993 20.5637 20.9974 20.3323 21 20.09V3.95C20.9974 3.70774 20.8993 3.47629 20.727 3.30592C20.5548 3.13554 20.3223 3.03999 20.08 3.04V3Z" />
        <path
          d="M7.95701 8.66612L12.6259 13.0756L15.2426 10.3676L20.5512 16.1214L19.4488 17.1386L15.2174 12.5524L12.6741 15.1844L7.98297 10.7539L4.42836 14.2823L3.37163 13.2177L7.95701 8.66612Z"
          fillRule="evenodd"
          clipRule="evenodd"
        />
        <path
          d="M16.54 6.76C16.1921 6.76 15.91 7.04206 15.91 7.39C15.91 7.73794 16.1921 8.02 16.54 8.02C16.8879 8.02 17.17 7.73794 17.17 7.39C17.17 7.04206 16.8879 6.76 16.54 6.76ZM14.41 7.39C14.41 6.21363 15.3636 5.26 16.54 5.26C17.7164 5.26 18.67 6.21363 18.67 7.39C18.67 8.56636 17.7164 9.52 16.54 9.52C15.3636 9.52 14.41 8.56636 14.41 7.39Z"
          fillRule="evenodd"
          clipRule="evenodd"
        />
      </g>
      <defs xmlns="http://www.w3.org/2000/svg">
        <clipPath id="clip0_1_146">
          <rect width="18" height="18" fill="white" transform="translate(3 3)" />
        </clipPath>
      </defs>
    </IconBase>
  ))
);
